emacs.org
#+TITLE: Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./.emacs.d/init.el

Emacs configuration.

* table of contents                                                 :toc:
:PROPERTIES:
:TOC: :include all :ignore this
:END:
- [[#preamble][Preamble]]
- [[#machine-specific-code-and-package-initialisation][Machine specific code, and package initialisation]]
- [[#site-specific-code][Site specific code]]
- [[#general-configuration][General configuration]]
- [[#package-management][Package Management]]
- [[#ivy][Ivy]]
- [[#swiper][Swiper]]
- [[#which-key][Which-key]]
- [[#ispell][ispell]]
- [[#ledger][Ledger]]
- [[#go][Go]]
- [[#python][Python]]
- [[#sql][SQL]]
- [[#c][C++]]
- [[#multiple-cursors][Multiple Cursors]]
- [[#org-mode][Org-mode]]
- [[#org-bullet-mode][Org Bullet mode]]
- [[#org-roam][Org-roam]]
- [[#licence-boilerplate][Licence Boilerplate]]
- [[#auctex][Auctex]]
- [[#reftex][Reftex]]
- [[#hydra][Hydra]]
- [[#javascript-and-html][Javascript and HTML]]
- [[#company-mode][Company mode]]
- [[#magit][Magit]]
- [[#flycheck][Flycheck]]
- [[#all-the-icons][All the icons]]
- [[#themes][Themes]]
- [[#eyebrowse][eyebrowse]]
- [[#projectile][Projectile]]
- [[#powerline][Powerline]]
- [[#paredit][Paredit]]
- [[#clojure][Clojure]]
- [[#lisp][Lisp]]
- [[#emacs-lisp][emacs-lisp]]
- [[#mu4e---email][mu4e - Email]]
- [[#org-caldav][org-caldav]]
- [[#helpful][Helpful]]
- [[#erc][ERC]]
- [[#toc-org][toc-org]]
- [[#ox-hugo][ox-hugo]]

* Preamble

#+begin_src emacs-lisp
;;; init.el --- Startup file for emacs

;;; Commentary:
;; Initial configuration file loaded by Emacs.
;;  - Sets the custom configuration file location
;; This file is generated from init.org and tangled. Changes should
;; be made to that file; also for more information - see details there.
;;
;; (c) 2017 - 2021 Paul Jewell
;; Licence: BSD

;;; Code:
#+end_src

* Machine specific code, and package initialisation

#+begin_src emacs-lisp
;; Load machine local definitions
(load-file "~/.emacs.d/site-specific.el")

(require 'site-specific "~/.emacs.d/site-specific.el")

(defvar *packages-initialised* nil)

(defun initialise-packages ()
  "Ensure `package-initialize' is called only once."
  (unless *packages-initialised*
    (package-initialize)
    (setq *packages-initialised* t)))

(initialise-packages)

#+end_src

* Site specific code
Some opportunity for refactoring here. Currently this code tangles to
a separate file, but perhaps better if the code fed out to specific
files for each machine?

#+begin_src  emacs-lisp :tangle ./.emacs.d/site-specific.el
;;; Site-specific.el --- local variables for each system
;;; commentary:
;;; code:

;; Globals to configure which blocks are loaded

(defvar *pj/enable-mu4e-mode* nil   "Enable mu4e mode.")
(defvar *pj/load-site-gentoo* nil   "Load gentoo's config file.")
(defvar *pj/enable-auctex*    nil   "Enable auctex mode.")
(defvar *pj/font-size*        "10"  "Fontsize for this system.")

(defvar *pj/info-default-directory-list* "~/Nextcloud/git/org-mode/doc")

(defun pj/is-windows-p ()
  "True if run in windows environment."
  (string= "windows-nt" system-type))

(defun pj/is-linux-p ()
  "True if run in linux environment."
  (string= "gnu/linux" system-type))

;; Three possibilities for specifying values:

;; - Globally, for all systems
;; - By operating system
;; - By system name

(cond
 ((pj/is-linux-p)
  (if (string-prefix-p "DESKTOP" (system-name)) ;; Windows WSL2 on Tristan
      (progn
        (require 'gnutls)
        (setq gnutls-algorithm-priority "NORMAL:-VERS-TLS1.3")
	     (setq *pj/enable-mu4e-mode* t)
	     (setq *pj/load-site-gentoo* nil)
	     (setq *pj/enable-auctex* t)
	     
	     ;; define the location of the orgmode code
	     (add-to-list 'load-path "/mnt/c/Users/paul/Nextcloud/git/org-mode/lisp")
	     (add-to-list 'load-path "/mnt/c/Users/paul/Nextcloud/git/org-mode/contrib/lisp")
        (defvar *pj/org-agenda-files* '("/mnt/c/Users/paul/Nextcloud/org"))
        (defvar *pj/org-roam-directory*   "/mnt/c/Users/paul/Nextcloud/git/org/roam/")
        (defvar *pj/org-roam-db-location* "/mnt/c/Users/paul/Nextcloud/git/org/org-roam.db")
	     (setq *pj/font-size* "10"))
    (progn
      (setq *pj/enable-mu4e-mode* t)
      (setq *pj/load-site-gentoo* t)
      (setq *pj/enable-auctex* t)
	   ;; define the location of the orgmode code
	   (add-to-list 'load-path "~/Nextcloud/git/org-mode/lisp")
	   (add-to-list 'load-path "~/Nextcloud/git/org-mode/contrib/lisp")
      (defvar *pj/org-agenda-files* '("~/Nextcloud/org"))
      (defvar *pj/org-roam-directory*   "~/Nextcloud/git/org/roam/")
      (defvar *pj/org-roam-db-location* "~/Nextcloud/git/org/org-roam.db"))))
 ((pj/is-windows-p) ;; Not WSL2 installation - that is declared as linux
  (progn
    (setq *pj/enable-mu4e-mode* nil)
    (setq *pj/load-site-gentoo* nil)
    (setq *pj/enable-auctex* nil)
    
    ;; define the location of the orgmode code
    (add-to-list 'load-path  "c:/users/paul/Nextcloud/git/org-mode/lisp")
    (add-to-list 'load-path "c:/users/Paul/Nextcloud/git/org-mode/contrib/lisp")
    (defvar *pj/my-org-roam-directory* "c:/users/Paul/Nextcloud/git/org/roam/")
    (defvar *pj/org-agenda-files* '("~/Nextcloud/org"))
    (defvar *pj/org-roam-directory*   "~/Nextcloud/git/org/roam/")
    (defvar *pj/org-roam-db-location* "~/Nextcloud/git/org/org-roam.db")
    (setq *pj/font-size* "10")))
 (t
  (error "Undefined system-type %s" system-type)))

(provide 'site-specific)
;;; site-specific.el ends here


#+end_src

#+begin_src emacs-lisp

;; To load external version of org-mode, clone the code from git:
;; > cd <directory below which you want the org code>
;; > git clone https://code.orgmode.org/bzg/org-mode.git
;; > cd org-mode
;; > make autoloads # creates org-loaddefs.el in the lisp directory

(add-to-list 'auto-mode-alist '("\\.\\(org\\|org_archive\\|txt\\)$" . org-mode))
(use-package org
    :ensure t)

(defvar init-dir) ;; Initial directory for emacs configuration
(setq init-dir (file-name-directory (or load-file-name (buffer-file-name))))

;; Save emacs customisations in this file:
(setq custom-file "~/.emacs.d/emacs-custom.el")
(load custom-file)

#+end_src

* General configuration

#+begin_src emacs-lisp

;;==============================================================================
;;.....General configuration
;;     ---------------------

(if *pj/load-site-gentoo*
    (require 'site-gentoo))

;; Set default modes
(setq major-mode 'text-mode)
(add-hook 'text-mode-hook 'turn-on-auto-fill)

;; Go straight to scratch buffer on startup
(setq inhibit-startup-screen t)

;; dont use tabs for indenting
(setq-default indent-tabs-mode nil)
(setq-default tab-width 3)
(setq-default sh-basic-offset 2)
(setq-default sh-indentation 2)

;; Changes all yes/no questions to y/n type
(fset 'yes-or-no-p 'y-or-n-p)
(set-variable 'confirm-kill-emacs 'yes-or-no-p)

;; Eliminate C-z sleep
(global-unset-key [(control z)])
(global-unset-key [(control x)(control z)])

;; The following lines are always needed. Choose your own keys.
(global-font-lock-mode t)
(global-set-key "\C-x\C-l" 'goto-line)
(global-set-key "\C-x\C-y" 'copy-region-as-kill)

;; Remove the tool-bar from the top
(tool-bar-mode -1)
;; (menu-bar-mode -1)
(scroll-bar-mode -1)

;; Full path in title bar
(setq-default frame-title-format "%b (%f)")

(defalias 'list-buffers 'ibuffer)

(setq backup-directory-alist `(("." . ,(concat user-emacs-directory "Backups"))))
#+end_src

* Package Management

Packages are currently installed using use-package. With the
configuration of a guix laptop, there is an opportunity to use guix to
load the packages into the system. Use of guix on top of gentoo is
still to be explored...

#+begin_src emacs-lisp

;;==============================================================================
;;.....Package management
;;     ------------------

(require 'gnutls)

(defvar pj/python)
(setq pj/python (executable-find "python"))

(defvar pj/gnu '("gnu" . "https://elpa.gnu.org/packages/"))
(defvar pj/melpa '("melpa" . "https://melpa.org/packages/"))
(defvar pj/melpa-stable '("melpa-stable" . "https://stable.melpa.org/packages/"))
(defvar pj/org-elpa '("org" . "https://orgmode.org/elpa/"))

;; Add marmalade to package repos
(setq package-archives nil)
(add-to-list 'package-archives pj/melpa-stable t)
(add-to-list 'package-archives pj/melpa t)
(add-to-list 'package-archives pj/gnu t)
(add-to-list 'package-archives pj/org-elpa t)

(initialise-packages)

(unless (and (file-exists-p (concat init-dir "elpa/archives/gnu"))
             (file-exists-p (concat init-dir "elpa/archives/melpa"))
             (file-exists-p (concat init-dir "elpa/archives/melpa-stable"))
             (file-exists-p (concat init-dir "elpa/archives/org")))
  (package-refresh-contents))

(defun packages-install (&rest packages)
  "Install PACKAGES."
  (message "running packages-install")
  (mapc (lambda (package)
          (let ((name (car package))
                (repo (cdr package)))
            (when (not (package-installed-p name))
              (let ((package-archives (list repo)))
                (initialise-packages)
                (package-install name)))))
        packages)
  (initialise-packages)
  (delete-other-windows))

;; Install extensions if they're missing
(defun init--install-packages ()
  "Install some packages."
  (message "Lets install some packages")
  (packages-install
   ;; Since use-package this is the only entry here
   ;; ALWAYS try to use use-package!
   (cons 'use-package pj/melpa)
   ))

(condition-case nil
    (init--install-packages)
  (error
   (package-refresh-contents)
   (init--install-packages)))
#+end_src

* Ivy

#+begin_src emacs-lisp
;;==============================================================================
;;.....Ivy
;;     ---

(use-package ivy
  :ensure t
  :diminish
  :bind (("C-s" . swiper)
         :map ivy-minibuffer-map
         ("TAB" . ivy-alt-done)
         ("C-l" . ivy-alt-done)
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         :map ivy-switch-buffer-map
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill)
         :map ivy-reverse-i-search-map
         ("C-k" . ivy-previous-line)
         ("C-d" . ivy-reverse-i-search-kill))
  :config
  (ivy-mode 1)
  (setq ivy-use-virtual-buffers t)
  (setq ivy-wrap t)
  (setq ivy-count-format "(%d/%d) ")
  (setq enable-recursive-minibuffers t)

  (push '(completion-at-point . ivy--regex-fuzzy) ivy-re-builders-alist)
  (push '(swiper . ivy--regex-ignore-order) ivy-re-builders-alist)
  (push '(counsel-M-x . ivy--regex-ignore-order) ivy-re-builders-alist)

  (setf (alist-get 'swiper ivy-height-alist) 15)
  (setf (alist-get 'counsel-switch-buffer ivy-height-alist) 7))

(use-package ivy-hydra
  :defer t
  :after hydra)

(use-package ivy-rich
  :ensure t
  :init
  (ivy-rich-mode 1)
  :config
  (setcdr  (assq t ivy-format-functions-alist) #'ivy-format-function-line)
  (setq ivy-rich-display-transformers-list
        (plist-put ivy-rich-display-transformers-list
                   'ivy-switch-buffer
                   '(:columns
                     ((ivy-rich-candidate (:width 40))
                      (ivy-rich-switch-buffer-indicators (:width 4 :face error :align right)); return the buffer indicators
                      (ivy-rich-switch-buffer-major-mode (:width 12 :face warning))          ; return the major mode info
                      (ivy-rich-switch-buffer-project (:width 15 :face success))             ; return project name using `projectile'
                      (ivy-rich-switch-buffer-path (:width (lambda (x) (ivy-rich-switch-buffer-shorten-path x (ivy-rich-minibuffer-width 0.3))))))  ; return file path relative to project root or `default-directory' if project is nil
                     :predicate
                     (lambda (cand)
                       (if-let ((buffer (get-buffer cand)))
                           ;; Don't mess with EXWM buffers
                           (with-current-buffer buffer
                             (not (derived-mode-p 'exwm-mode)))))))))
#+end_src

* Swiper

#+begin_src emacs-lisp
;;==============================================================================
;;.....Swiper
;;     ------

;; Counsel - completion package working with ivy.
(use-package counsel
  :ensure t
  :bind (("M-x" . counsel-M-x)
         ("C-x b" . counsel-ibuffer)
         :map minibuffer-local-map
         ("C-r" . 'counsel-minibuffer-history))
  :custom
  (counsel-linux-app-format-function #'counsel-linux-app-format-function-name-only)
  :config
  (setq ivy-initial-inputs-alist nil)) ;; Don't start searches with ^

;; TODO: Configure counsel-bbdb to work eith email, or configure a different
;;       package to manage contacts (synced with cardDAV)
(use-package counsel-bbdb
  :ensure t)

(use-package swiper
  :ensure t
  :bind (("C-s" . swiper)
         ("C-r" . swiper)
         ("C-c C-r" . ivy-resume)
         ("M-x" . counsel-M-x)
         ("C-x C-f" . counsel-find-file))
  :config
  (progn
    (ivy-mode 1)
    (setq ivy-use-virtual-buffers t)
    (setq ivy-display-style 'fancy)
    (define-key read-expression-map (kbd "C-r") 'counsel-expression-history)))

#+end_src

